# CouplerNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CouplerNumber Property
ParameterTypeId Class See Also
---
"Coupler Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CouplerNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouplerNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CouplerNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace